---
kind: method
id: M:Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetFaceReference
source: html/150ea4ff-2074-6575-d120-248a1777e03a.htm
---
# Autodesk.Revit.DB.PointOnEdgeFaceIntersection.GetFaceReference Method

Get a copy of the face reference.

## Syntax (C#)
```csharp
public Reference GetFaceReference()
```